In [3]:
import numpy as np
import pandas as pd

%config IPCompleter.greedy = True

# Suppress scientific notation
np.set_printoptions(suppress=True)

In [3]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
movies = pd.read_csv('http://bit.ly/imdbratings')
orders = pd.read_csv('http://bit.ly/chiporders', sep='\t')
orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')
stocks = pd.read_csv('http://bit.ly/smallstocks', parse_dates=['Date'])
titanic = pd.read_csv('http://bit.ly/kaggletrain')
ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates=['Time'])

# RENAMING COLUMNS

In [8]:
stocks.head()

        date   close    volume symbol
0 2016-10-03   31.50  14070500   CSCO
1 2016-10-03  112.52  21701800   AAPL
2 2016-10-03   57.42  19189500   MSFT
3 2016-10-04  113.00  29736800   AAPL
4 2016-10-04   57.24  20085900   MSFT

#### METHOD 1: CHANGE COLUMN NAMES TO ALL UPPERCASE

In [5]:
mapper = {
    'Date': 'DATE',
    'Close': 'CLOSE',
    'Volume': 'VOLUME',
    'Symbol': 'SYMBOL',
}
stocks.rename(columns=mapper, inplace=True)

#### METHOD 2: CHANGE COLUMN NAMES TO ALL LOWERCASE

In [7]:
stocks.columns = ['date', 'close', 'volume', 'symbol']

#### METHOD 3: CHANGE ALL COLUMN NAMES TO CAPITALIZED

In [10]:
stocks.columns = stocks.columns.str.upper()

#### ADD PREFIX TO ALL COLUMNS

In [40]:
stocks.add_prefix('X_').head(n=2)

      X_DATE  X_CLOSE  X_VOLUME X_SYMBOL
0 2016-10-03    31.50  14070500     CSCO
1 2016-10-03   112.52  21701800     AAPL

#### ADD SUFFIX TO ALL COLUMNS

In [41]:
stocks.add_suffix('_Y').head(n=2)

      DATE_Y  CLOSE_Y  VOLUME_Y SYMBOL_Y
0 2016-10-03    31.50  14070500     CSCO
1 2016-10-03   112.52  21701800     AAPL

# REVERSE COLUMN ORDER

#### METHOD 1

In [43]:
stocks.loc[:, ::-1].head()

  SYMBOL    VOLUME   CLOSE       DATE
0   CSCO  14070500   31.50 2016-10-03
1   AAPL  21701800  112.52 2016-10-03
2   MSFT  19189500   57.42 2016-10-03
3   AAPL  29736800  113.00 2016-10-04
4   MSFT  20085900   57.24 2016-10-04

#### METHOD 2

In [51]:
stocks[reversed(stocks.columns)].head()

  SYMBOL    VOLUME   CLOSE       DATE
0   CSCO  14070500   31.50 2016-10-03
1   AAPL  21701800  112.52 2016-10-03
2   MSFT  19189500   57.42 2016-10-03
3   AAPL  29736800  113.00 2016-10-04
4   MSFT  20085900   57.24 2016-10-04

#### METHOD 3

In [52]:
stocks[stocks.columns[::-1]].head()

  SYMBOL    VOLUME   CLOSE       DATE
0   CSCO  14070500   31.50 2016-10-03
1   AAPL  21701800  112.52 2016-10-03
2   MSFT  19189500   57.42 2016-10-03
3   AAPL  29736800  113.00 2016-10-04
4   MSFT  20085900   57.24 2016-10-04

# REVERSE ROW ORDER

In [47]:
stocks.loc[::-1, :].reset_index(drop=True)

        DATE   CLOSE    VOLUME SYMBOL
0 2016-10-05  113.05  21453100   AAPL
1 2016-10-05   31.59  11808600   CSCO
2 2016-10-05   57.64  16726400   MSFT
3 2016-10-04   31.35  18460400   CSCO
4 2016-10-04   57.24  20085900   MSFT
5 2016-10-04  113.00  29736800   AAPL
6 2016-10-03   57.42  19189500   MSFT
7 2016-10-03  112.52  21701800   AAPL
8 2016-10-03   31.50  14070500   CSCO

### HOW TO ASSIGN NAME TO THE INDEX OF A SERIES
If we name the series it will automatically be given the same name if we include the series in a dataframe

In [20]:
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser.name = 'alphabet'
pd.DataFrame(ser).head()

  alphabets
0         a
1         b
2         c
3         e
4         d